#language: ru

Функционал: Проверка главной страницы
    Сценарий: Открываем главную страницу и переходим по разделам

        Когда пользователь находится на Главной странице
        Тогда на странице присутствует ссылка "Home"
        Тогда на странице присутствует ссылка "Modular"
        Тогда на странице присутствует ссылка "Sign In"
        Тогда на странице присутствует ссылка "Sign Up"
        Тогда на странице присутствует ссылка "About"
        И пользователь нажимает на "Modular"
        Тогда на странице присутствует ссылка "Home"
        Тогда на странице присутствует ссылка "Modular"
        Тогда на странице присутствует ссылка "Sign In"
        Тогда на странице присутствует ссылка "Sign Up"
        Тогда на странице присутствует ссылка "About"
        И пользователь нажимает на "About"
        Тогда на странице присутствует ссылка "Home"
        Тогда на странице присутствует ссылка "Modular"
        Тогда на странице присутствует ссылка "Sign In"
        Тогда на странице присутствует ссылка "Sign Up"
        Тогда на странице присутствует ссылка "About"
        И пользователь нажимает на "Sign In"
        Тогда на странице присутствует ссылка "Home"
        Тогда на странице присутствует ссылка "Modular"
        Тогда на странице присутствует ссылка "Sign In"
        Тогда на странице присутствует ссылка "Sign Up"
        Тогда на странице присутствует ссылка "About"
        И пользователь нажимает на "Sign Up"
        Тогда на странице присутствует ссылка "Home"
        Тогда на странице присутствует ссылка "Modular"
        Тогда на странице присутствует ссылка "Sign In"
        Тогда на странице присутствует ссылка "Sign Up"
        Тогда на странице присутствует ссылка "About"

